{
  "nav_about": "Sobre Mí",
  "nav_skills": "Habilidades",
  "nav_projects": "Proyectos",
  "nav_blog": "Blog",
  "nav_contact": "Contacto",
  "hero_title": "Desarrollador Web Frontend",
  "hero_subtitle": "Creando soluciones digitales, funcionales y atractivas con un enfoque en la calidad y el rendimiento.",
  "hero_button": "Ver mis Proyectos",
  "about_title": "Sobre Mí",
  "about_p1": "¡Hola! Soy Benjamín Ramírez, un apasionado desarrollador web enfocado en el Frontend. Mi viaje en el mundo de la programación comenzó con el deseo de transformar ideas creativas en experiencias digitales interactivas y funcionales.",
  "about_p2": "Con una base sólida en tecnologías como HTML, CSS, SASS y JavaScript, disfruto construyendo interfaces limpias, accesibles y de alto rendimiento. Mi objetivo es aportar valor a través de un código de calidad y una mentalidad de aprendizaje continuo, buscando siempre el siguiente desafío para crecer como profesional.",
  "skills_title": "Mis Habilidades",
  "projects_title": "Mis Proyectos",
  "blog_title": "Mis Artículos",
  "contact_title": "Hablemos",
  "contact_description": "¿Tienes una pregunta o una propuesta o simplemente quieres saludar? Adelante.",
  "contact_form_name": "Nombre",
  "contact_form_email": "Correo Electrónico",
  "contact_form_message": "Mensaje",
  "contact_form_button": "Enviar Mensaje",
  "footer_copyright": "&copy; 2025 Benjamín Ramírez. Todos los derechos reservados.",
  "skill_html_desc": "Estructura semántica y accesible para una web sólida y bien organizada.",
  "skill_css_desc": "Estilos modernos, layouts complejos con Flexbox y Grid, y animaciones fluidas.",
  "skill_sass_desc": "Uso de preprocesadores para un código CSS escalable, modular y fácil de mantener.",
  "skill_js_desc": "Interactividad y dinamismo del lado del cliente, manipulación del DOM y lógica de UI.",
  "skill_git_desc": "Control de versiones para un desarrollo seguro, colaborativo y profesional.",
  "skill_github_desc": "Flujo de trabajo con repositorios remotos, ramas, pull requests y code reviews.",
  "skill_responsive_desc": "Diseños que se adaptan y funcionan perfectamente en cualquier dispositivo y tamaño de pantalla.",
  "skill_a11y_name": "Accesibilidad",
  "skill_a11y_desc": "Creación de experiencias web inclusivas y usables para todos los usuarios (WCAG).",
  "skills_footer_text": "Estas son algunas de las tecnologías y herramientas que utilizo para crear experiencias web excepcionales.",
  "project_nudos_title": "Nudos Del Alma",
  "project_nudos_desc": "Una landing page totalmente responsiva para un emprendimiento de macramé. Construida con un enfoque en la semántica HTML, una arquitectura SASS profesional y un código JavaScript limpio para las interacciones.",
  "project_card_button_details": "Ver Detalles",
  "project_card_button_code": "Ver Código",
  "modal_rol": "Rol",
  "modal_rol_desc": "Desarrollo Frontend",
  "modal_client": "Cliente",
  "modal_client_desc": "Emprendimiento Local",
  "modal_tech": "Tecnologías",
  "modal_duration": "Duración",
  "modal_duration_desc": "2 Semanas",
  "modal_features_title": "Características Clave",
  "modal_feature_1": "Diseño 100% responsivo (Mobile-First).",
  "modal_feature_2": "Animaciones de entrada con Intersection Observer.",
  "modal_feature_3": "Galería de imágenes interactiva.",
  "modal_feature_4": "Formulario de contacto funcional con Formspree.",
  "modal_button_site": "Ver Sitio"
}